 > create:
function declaration:2
<<<#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    param2: Foo & (Bar & Baz),
    param3: Foo & (Bar | Baz),
    param4: #(Foo, Bar => Baz),
    param5: #(Foo => Bar),
    param6: #Bar,
    param7: #Bar[] & #Baz
);>>>


 > create:
parameter:3
#test(
    <<<param1: Foo & Boo?[] & Bar | Baz & Goo[][]>>>,
    param2: Foo & (Bar & Baz),
    param3: Foo & (Bar | Baz),
    param4: #(Foo, Bar => Baz),
    param5: #(Foo => Bar),
    param6: #Bar,
    param7: #Bar[] & #Baz
);


 > create:
parameter:4
#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    <<<param2: Foo & (Bar & Baz)>>>,
    param3: Foo & (Bar | Baz),
    param4: #(Foo, Bar => Baz),
    param5: #(Foo => Bar),
    param6: #Bar,
    param7: #Bar[] & #Baz
);


 > create:
parameter:5
#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    param2: Foo & (Bar & Baz),
    <<<param3: Foo & (Bar | Baz)>>>,
    param4: #(Foo, Bar => Baz),
    param5: #(Foo => Bar),
    param6: #Bar,
    param7: #Bar[] & #Baz
);


 > create:
parameter:6
#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    param2: Foo & (Bar & Baz),
    param3: Foo & (Bar | Baz),
    <<<param4: #(Foo, Bar => Baz)>>>,
    param5: #(Foo => Bar),
    param6: #Bar,
    param7: #Bar[] & #Baz
);


 > create:
parameter:7
#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    param2: Foo & (Bar & Baz),
    param3: Foo & (Bar | Baz),
    param4: #(Foo, Bar => Baz),
    <<<param5: #(Foo => Bar)>>>,
    param6: #Bar,
    param7: #Bar[] & #Baz
);


 > create:
parameter:8
#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    param2: Foo & (Bar & Baz),
    param3: Foo & (Bar | Baz),
    param4: #(Foo, Bar => Baz),
    param5: #(Foo => Bar),
    <<<param6: #Bar>>>,
    param7: #Bar[] & #Baz
);


 > create:
parameter:9
#test(
    param1: Foo & Boo?[] & Bar | Baz & Goo[][],
    param2: Foo & (Bar & Baz),
    param3: Foo & (Bar | Baz),
    param4: #(Foo, Bar => Baz),
    param5: #(Foo => Bar),
    param6: #Bar,
    <<<param7: #Bar[] & #Baz>>>
);


 > merge:
compilation unit 1 {
  declaration: function declaration 2 >> 1 {
    name: test
    parameter: parameter 3 >> 2 {
      type: Foo & Boo?[] & Bar | Baz & Goo[][]
      name: param1
    }
    parameter: parameter 4 >> 2 {
      type: Foo & (Bar & Baz)
      name: param2
    }
    parameter: parameter 5 >> 2 {
      type: Foo & (Bar | Baz)
      name: param3
    }
    parameter: parameter 6 >> 2 {
      type: #(Foo, Bar => Baz)
      name: param4
    }
    parameter: parameter 7 >> 2 {
      type: #(Foo => Bar)
      name: param5
    }
    parameter: parameter 8 >> 2 {
      type: #Bar
      name: param6
    }
    parameter: parameter 9 >> 2 {
      type: #Bar[] & #Baz
      name: param7
    }
  }
}

